Revit 2027 API
ColorFillScheme.GetSupportedParameterIds Method
 Retrieves collection of all parameters supported by the scheme.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetSupportedParameterIds()
Public Function GetSupportedParameterIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetSupportedParameterIds()
member GetSupportedParameterIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
Remarks
 Supported parameters depends on CategoryId property.
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace